ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/ad5940/ad5940_buffering.c
/**
***************************************************************************
* @file         ad5940_buffering.c
* @author       ADI
* @version
* @date         26-Jun-2019
* @brief        Layer to read the AD5940 data
*
***************************************************************************
* @attention
***************************************************************************
*/
/******************************************************************************
*                                                                             *
* License Agreement                                                           *
*                                                                             *
* Copyright (c) 2020 Analog Devices Inc.                                      *
* All rights reserved.                                                        *
*                                                                             *
* This source code is intended for the recipient only under the guidelines of *
* the non-disclosure agreement with Analog Devices Inc.                       *
*                                                                             *
* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR  *
* IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,    *
* FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE *
* AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER      *
* LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING     *
* FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER         *
* DEALINGS IN THE SOFTWARE.                                                   *
*                                                                             *
*                                                                             *
* This software is intended for use with the ad5940 and derivative parts     *
* only                                                                        *
*                                                                             *
******************************************************************************/
#include <string.h>
#include <stdio.h>
#include <assert.h>
#include "ad5940.h"
#include <hw_if_config.h>
#include "sensor_ad5940.h"
#include "eda_application_task.h"
#ifdef ENABLE_ECG_APP
#include "adi_ecg.h"
#endif
#ifdef ENABLE_BIA_APP
#include "bia_application_task.h"
#endif
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "us_tick.h"
#include "rtc.h"
#ifdef VSM_MBOARD
#include "watch_vsm_motherboard_pin_config.h"
#elif PCBA
#include "watch_board_pcba_pin_config.h"
#else
#include "watch_board_evt_pin_config.h"
#endif
#include "nrf_drv_gpiote.h"
/************************************************* Private macros ***********************************************************/

#define AD5940_RX_BUFFER_SIZE            20

/****** Driver related declarations start ********/
#define WATERMARK_VALUE 16

/************************************************* Structures ***********************************************************/


/*!
 *  @internal
    @struct Rx_Buffer_Def_Struct
    @brief Received data's Ring Buffer Structure
    @var Rx_Buffer_Def_Struct::DataValue
    Data contained in the current buffer
    @var Rx_Buffer_Def_Struct::Next
    Pointer to next buffer structure
 */
typedef struct Ad5940_Rx_Buffer_Def_Struct {
    uint32_t nDataValueR;
    uint32_t nDataValueI;
    uint32_t nTimeStamp;
    struct Ad5940_Rx_Buffer_Def_Struct* Next;
} AD5940_RX_BUFFER_DEF;


/************************************************* Private variables ***********************************************************/
uint16_t gnAd5940TimeGap = 0;
#if DEBUG_ECG
uint16_t gnAd5940TimeGap1 = 10;
uint16_t gnAd5940TimeGap2 = 10;
#endif
uint8_t gnAd5940NumberOfEcgData = 0;
uint8_t bMeasureVolt = 1;
uint8_t gnAd5940TimeIrqSet = 0, gnAd5940TimeIrqSet1 = 0;
uint32_t gn_DivErr_Cnt = 0, gn_ecg_fetch_data_cnt = 0;
uint32_t gn_ad5940_isr_cnt = 0;
uint32_t gn_eda_fetch_data_cnt = 0;
uint32_t BiaFifoCount;
uint16_t BiaRealImgDataSetCount;
/****** Driver related declarations start ********/
int32_t anRegReadAd5940Data[WATERMARK_VALUE] = {0};
AD5940_RX_BUFFER_DEF Ad5940RxBuff[AD5940_RX_BUFFER_SIZE];
AD5940_RX_BUFFER_DEF *Ad5940WtBufferPtr, *Ad5940RdBufferPtr;
volatile uint8_t gnAd5940DataReady;
uint32_t gnAd5940TimeCurVal = 0, gnAd5940TimePreVal = 0;
uint32_t gnAd5940TimeCurVal_copy = 0;
uint32_t gnAd5940TimeCurValInMicroSec = 0;
uint32_t gnAd5940TimePrevVal = 0;
uint32_t FifoCount;
AD5940_APP_ENUM_t gnAd5940App = AD5940_APP_NONE;
#ifdef DEBUG_EDA
uint32_t eda_tick=0,eda_tick_prev=0;
uint32_t eda_load_time_diff=0;
#endif
#ifdef DEBUG_BCM
uint32_t bia_tick=0,bia_tick_prev=0,bia_load_time_diff=0;
#endif
static uint8_t FifoOverflow = 0;
static uint32_t fifo_cnt=0;
uint32_t nTcv = 0;
static bool day_roll_over = false; //flag to track day roll-over

/************************************************* External variables ***********************************************************/
#ifdef ENABLE_ECG_APP
extern ADI_OSAL_SEM_HANDLE   ecg_task_evt_sem;
extern AppECGCfg_Type AppECGCfg;
#endif
#ifdef ENABLE_EDA_APP
extern ADI_OSAL_SEM_HANDLE   eda_task_evt_sem;
extern g_state_eda_t g_state_eda;
extern AppEDACfg_Type AppEDACfg;
#endif
#ifdef ENABLE_BIA_APP
extern ADI_OSAL_SEM_HANDLE   bia_task_evt_sem;
extern AppBIACfg_Type AppBIACfg;
#endif

/************************************************* Function declarations ***********************************************************/
int8_t ad5940_buff_get(uint32_t *rdData, uint32_t *time);
int8_t ad5940_buff_put(int32_t *pRegReadData, uint32_t nTcv);
uint8_t getAd5940DataReady();
void ResetTimeGapAd5940();



/*!
  ****************************************************************************
  *@brief      Clear AD5940 soft buffer
  *@param      None
  *@return     None
******************************************************************************/
void ClearDataBufferAd5940() {
    Ad5940WtBufferPtr = &Ad5940RxBuff[0];
    Ad5940RdBufferPtr = &Ad5940RxBuff[0];
    gnAd5940TimePrevVal = 0;
}

/*!
  ****************************************************************************
  *@brief      Reset time gap when FIFO is cleared
  *@param      None
  *@return     None
******************************************************************************/
void ResetTimeGapAd5940() {
   gnAd5940TimePrevVal = 0;
   gnAd5940TimeGap = 10;
}


/*!
  ****************************************************************************
  *@brief       Create a Ring Buffer to store received data.
  *@param      None
  *@return     None
******************************************************************************/
void Ad5940RxBufferInit(void) {
    uint8_t aLoopCount;
    /* clear soft buffer */
    ClearDataBufferAd5940();
    gnAd5940NumberOfEcgData = 0;
    /* create ring buffer */
    for (aLoopCount = 0; aLoopCount < AD5940_RX_BUFFER_SIZE; aLoopCount++) {
        Ad5940RxBuff[aLoopCount].Next = &Ad5940RxBuff[aLoopCount + 1];
    }
    /* address of last value in buffer linked to first to
      form ring buffer */
    Ad5940RxBuff[AD5940_RX_BUFFER_SIZE - 1].Next = &Ad5940RxBuff[0];
}

/*!
  ****************************************************************************
  *@brief      Get AD5940 Interrupt ready flag
  *@param      None
  *@return     None
******************************************************************************/
uint8_t getAd5940DataReady(){

  return gnAd5940DataReady;

