ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/ad5940/ad5940_buffering.c
}

/*!
  ****************************************************************************
  *@brief      Get AD5940 Interrupt count which is required for debug purposes
  *@param      None
  *@return     None
******************************************************************************/
uint32_t Ad5940DrvGetDebugInfo() {
  return gn_ad5940_isr_cnt;
}

#ifdef ENABLE_EDA_APP
/*!
  ****************************************************************************
  *@brief      Get FIFO Count, if FIFO Overflow return failure, else return
               success
  *@param      *fifo_sample_cnt : Pointer to variable FIFO Count
  *@return     1 ( Failure ) /0 ( Success )
******************************************************************************/
uint8_t get_fifostat(uint32_t *fifo_sample_cnt) {
  if(g_state_eda.num_starts > 0)
  {
    if(FifoOverflow == 1) {
      *fifo_sample_cnt = fifo_cnt;
      return 1;
   }
   else {
      *fifo_sample_cnt = fifo_cnt;
      return 0;
   }
  }
  else  {
      *fifo_sample_cnt = 0;
      return 0;
  }
}
#endif

/*!
  ****************************************************************************
  *@brief      AD5940 FIFO Call back called when AD5940 ISR occurs
  *@param      None
  *@return     None
******************************************************************************/
void Ad5940FifoCallBack(void) {
    /* Read current time */
    gnAd5940TimeCurVal =  get_sensor_time_stamp();
#ifdef PROFILE_TIME_ENABLED
    gnAd5940TimeCurValInMicroSec = get_micro_sec();
#endif
    /* set ISR flag high */
    gnAd5940DataReady = 1;
    gnAd5940TimeIrqSet = 1;
    gnAd5940TimeIrqSet1 = 1;
    /* Increment isr count */
    gn_ad5940_isr_cnt++;

    switch(gnAd5940App){
#ifdef ENABLE_ECG_APP
      /* Case 1: ECG Interrupt */
      case AD5940_APP_ECG:
                /* post ecg semaphore */
                adi_osal_SemPost(ecg_task_evt_sem);
      break;
#endif
#ifdef ENABLE_EDA_APP
      case AD5940_APP_EDA:
      /* Case 2: EDA Interrupt */
#ifdef DEBUG_EDA
                /* timing obtained to know difference between successive EDA Interrupts */
                eda_tick = MCU_HAL_GetTick();
                eda_load_time_diff = eda_tick - eda_tick_prev;
                eda_tick_prev = eda_tick;
                NRF_LOG_INFO("Time diff b/n EDA Interrupts = %d",eda_load_time_diff);
#endif
                /* post eda semaphore */
                adi_osal_SemPost(eda_task_evt_sem);
      break;
#endif
#ifdef ENABLE_BIA_APP
      case AD5940_APP_BIA:
      /* Case 3: BCM Interrupt */
#ifdef DEBUG_BIA
                /* timing obtained to know difference between successive BCM Interrupts */
                bia_tick = MCU_HAL_GetTick();
                bia_load_time_diff = bia_tick - bia_tick_prev;
                bia_tick_prev = bia_tick;
                NRF_LOG_INFO("Time diff b/n BCM Interrupts = %d",bia_load_time_diff);
#endif
                /* post bcm semaphore */
                adi_osal_SemPost(bia_task_evt_sem);
      break;
#endif
      default:
      break;
     }
}


/*!
  ****************************************************************************
  *@brief      Move data from SPI FIFO to this Ring Buffer. If WtPtr reach RdPtr,
               host's reading is too slow.
  *@param      *pRegReadData: Pointer to data being read out from FIFO
  *             nTcv: Timestamp of the oldest data in the FIFO
  *@return      int8_t A 8-bit integer: 0 ( success );  -1 ( failure )
******************************************************************************/
int8_t ad5940_buff_put(int32_t *pRegReadData, uint32_t nTcv) {
    uint32_t nTimeStamp;
    /* when read = write pointer , return error */
    if (Ad5940WtBufferPtr->Next == Ad5940RdBufferPtr) {
        return AD5940Drv_ERROR;
    }
    /* calculate time stamp based on roll over */
    if (gnAd5940TimeIrqSet == 1 && gnAd5940TimeIrqSet1 == 0) {
        gnAd5940TimeIrqSet = 0;
        nTimeStamp = (uint32_t)(nTcv % MAX_RTC_TICKS_FOR_24_HOUR);
    } else {
        nTimeStamp = (uint32_t)((gnAd5940TimePreVal + gnAd5940TimeGap) % MAX_RTC_TICKS_FOR_24_HOUR);
    }
    /* assign current time stamp to previous value for next iteration  */
    gnAd5940TimePreVal = nTimeStamp;
    /* assign pointers to data and time stamp of Ring buffer */
    Ad5940WtBufferPtr->nTimeStamp = nTimeStamp;
    Ad5940WtBufferPtr->nDataValueR = *pRegReadData;
    if((gnAd5940App == AD5940_APP_EDA) || (gnAd5940App == AD5940_APP_BIA))
    {
      Ad5940WtBufferPtr->nDataValueI = *(pRegReadData+1);
    }
    /* Increment write pointer to point to next node */
    Ad5940WtBufferPtr = Ad5940WtBufferPtr->Next;
    gnAd5940NumberOfEcgData++;
    return AD5940Drv_SUCCESS;
}
/*!
  ****************************************************************************
  *@brief      Read Ring buffer which holds data and time stamp
  *@param      *rxData: data read from ring buffer
  *@param      *time: timestamp attached to data when it was written
  *@return     int8_t A 8-bit integer: 0 ( success );  -1 ( failure )
******************************************************************************/
int8_t ad5940_buff_get(uint32_t *rxData, uint32_t *time) {

    if (Ad5940RdBufferPtr == Ad5940WtBufferPtr) {
        /* Return error as there is no data in soft FIFO */
        return AD5940Drv_ERROR;
    }

    /* data read from ring buffer */
    *(rxData) = Ad5940RdBufferPtr->nDataValueR;
    if((gnAd5940App == AD5940_APP_EDA) || (gnAd5940App == AD5940_APP_BIA))
    {
      *(rxData+1) = Ad5940RdBufferPtr->nDataValueI;
    }

    /* read time stamp attached to written data from ring buffer
        if attached time is valid */
    if (time != 0) {
        *time = Ad5940RdBufferPtr->nTimeStamp;
    }

    /* Increment read pointer to point it to next node */
    Ad5940RdBufferPtr = Ad5940RdBufferPtr->Next;
    gnAd5940NumberOfEcgData--;
    return AD5940Drv_SUCCESS;
}
/*!
  ****************************************************************************
  *@brief      Read ECG data from the AD5940.
  *@param      None
  *@return     int8_t A 8-bit integer: 0 ( success );  -1 ( failure )
******************************************************************************/
#if DEBUG_ECG
uint16_t fifo_time1=0,fifo_time2=0,fifo_time_diff=0;
uint16_t fifo_read_flag=0;
uint16_t IncrementalFifolevel=0;
uint16_t time_interval=0;
uint16_t div_factor=0;
extern uint16_t fifo_threshold_not_four;
extern uint8_t debug_flag;
extern uint32_t gad5940TriggerPulseCnt;
struct trigger_fifo_level{
uint32_t cur_tick;
uint32_t prev_tick;
uint32_t tick_diff;
uint32_t trigger_cnt;
uint32_t fifo_cnt;
};

struct trigger_fifo_level trig_fifo_arr[250];
uint32_t ntrig_index = 0;
#endif

#ifdef ENABLE_ECG_APP
int8_t ad5940_read_ecg_data_to_buffer() {

