ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/ad5940/ad5940_buffering.c
  int32_t *pRegReadData;
  uint32_t Fifolevel;
  uint32_t nCount = 0;

  pRegReadData = &anRegReadAd5940Data[0];

  /* if ISR has occured */
  if(gnAd5940DataReady)  {
    /* clear ISR flag */
    gnAd5940DataReady = 0;
    /* Wakup AFE by read register, read 10 times at most */
    if(AD5940_WakeUp(10) > 10)  {
      /* Wakeup Failed */
      return AD5940ERR_WAKEUP;
    }
    /* We are operating registers, so we don't allow AFE enter sleep mode which is done in our sequencer */
    AD5940_SleepKeyCtrlS(SLPKEY_LOCK);

    /* incrment fetch count variable */
    gn_ecg_fetch_data_cnt++;
    /* If FIFO threshold flag is set high in AD5940 register field, read FIFO data */
    if(AD5940_INTCTestFlag(AFEINTC_0, AFEINTSRC_DATAFIFOTHRESH) == bTRUE) {
#if DEBUG_ECG
      fifo_time2 = MCU_HAL_GetTick();
      fifo_time_diff = fifo_time2- fifo_time1;
      fifo_time1 = fifo_time2;
#endif
      /* Now there should be fifo data ; number of samples to read is being set in
      ecg app which FIFO threshold variable*/
      Fifolevel = AD5940_FIFOGetCnt();
      NRFX_ASSERT(Fifolevel <= ECG_WATER_MARK_LEVEL);
#if DEBUG_ECG
       Fifolevel1=Fifolevel;
       trig_fifo_arr[ntrig_index].cur_tick = gnAd5940TimeCurVal;
       trig_fifo_arr[ntrig_index].prev_tick = gnAd5940TimePrevVal;
       trig_fifo_arr[ntrig_index].tick_diff = gnAd5940TimeCurVal - gnAd5940TimePrevVal;
       trig_fifo_arr[ntrig_index].trigger_cnt = gad5940TriggerPulseCnt;
       trig_fifo_arr[ntrig_index].fifo_cnt = Fifolevel;

       if(++ntrig_index >= 250)
          ntrig_index = 0;
#endif

#if DEBUG_ECG
      fifo_read_flag = 0;
      if(Fifolevel != 4){
        fifo_count_deviated[deviated_cnt++] = Fifolevel;
      }
      if(deviated_cnt == 50){
        deviated_cnt=0;
        memset(fifo_count_deviated,0,50);
      }
       IncrementalFifolevel += Fifolevel;
#endif
      AD5940_FIFORd(pRegReadData, Fifolevel);
      AD5940_INTCClrFlag(AFEINTSRC_DATAFIFOTHRESH);
      /* If there is need to do AFE re-configure, do it here when AFE is in active state */
      AppECGRegModify(pRegReadData, &Fifolevel);
      /* Allow AFE to enter sleep mode. AFE will stay at active mode until sequencer trigger sleep */
      AD5940_SleepKeyCtrlS(SLPKEY_UNLOCK);
      /* Read fifo data */
      AppECGDataProcess(pRegReadData,&Fifolevel);
      /* Process data */
      if (gnAd5940TimePrevVal != 0) {
      /* this happens in roll over when current time value is less than previous,
        handle roll over of time stamp */
        if(gnAd5940TimeCurVal < gnAd5940TimePrevVal)  {
          /* MAX_RTC_TICKS_FOR_24_HOUR:- Max RTC Count value returned by get_sensor_timestamp() after 24hrs.
          Adding that value to have correct TimeGap value during day roll-over */
          gnAd5940TimeGap = (uint16_t)((MAX_RTC_TICKS_FOR_24_HOUR + gnAd5940TimeCurVal - gnAd5940TimePrevVal) / Fifolevel);
          day_roll_over = true;
        }
        /* calculate time gap based on current time value - previous value */
        else  {
          gnAd5940TimeGap = (uint16_t)(((gnAd5940TimeCurVal - gnAd5940TimePrevVal) + (Fifolevel/2)) / Fifolevel);
        }
      }
      /* occurs when first time Interrupt data is read out , calculate time gap
        based on number of tick of RTC */
      else  {
        /* 32KHz is ticks resolution of RTC */
         gnAd5940TimeGap = (uint16_t)((1000.0/AppECGCfg.ECGODR) * RTC_TICKS_PER_MILLI_SEC);
      }
#if DEBUG_ECG
      if(Fifolevel != 4){
          time_interval = (gnAd5940TimeCurVal - gnAd5940TimePrevVal);
          div_factor = Fifolevel;
          if(debug_flag!=0){
            gnAd5940TimeGap1 = (uint16_t)((gnAd5940TimeCurVal_copy - gnAd5940TimePrevVal))/Fifolevel;
            gnAd5940TimeGap2 = (uint16_t)((gnAd5940TimeCurVal - gnAd5940TimePrevVal))/Fifolevel;
            Fifolevel1=Fifolevel;
            debug_flag=0;
          }
      }
#endif
      /* assign previous time value with current time value for next iteration */
      gnAd5940TimePrevVal = gnAd5940TimeCurVal;

      /* current time where data is processed */
      nTcv =  get_sensor_time_stamp();
      /* Normally, data processed time > interrupt occured time , hence update
      current time value by difference between current time when data is processed and
      time corresponding to interrupt occured */
      /*if ((nTcv > gnAd5940TimeCurVal) && (gnAd5940TimeGap != 0))  {
        //gnAd5940TimeCurVal += nTcv - gnAd5940TimeCurVal;
      }*/
      /* If current data processed time < Interrupt occured time, this could be case of
       roll over, update current time based on data processes time */
      if((nTcv < gnAd5940TimeCurVal) && (gnAd5940TimeGap != 0))  {
        gnAd5940TimeCurVal = nTcv;
        day_roll_over = true;
      }
      /* else, increment error count */
      else  {
        gn_DivErr_Cnt++;
      }
      /* If roll over flag is set */
      if(day_roll_over)   {
      /* MAX_RTC_TICKS_FOR_24_HOUR:- Max RTC Count value returned by get_sensor_timestamp() after 24hrs.
        Adding that value to have correct sample_interval during day roll-over */
        nTcv = (uint32_t)(MAX_RTC_TICKS_FOR_24_HOUR + gnAd5940TimeCurVal - ((Fifolevel * gnAd5940TimeGap) - gnAd5940TimeGap));
        /* Reset roll over flag */
        day_roll_over = false;
      }
      else  {
        nTcv = (uint32_t)(gnAd5940TimeCurVal - ((Fifolevel * gnAd5940TimeGap) - gnAd5940TimeGap));
      }

      gnAd5940TimeIrqSet1 = 0;
      /* put read data from fifo to ring buffer */
      for (nCount = 0; nCount < Fifolevel; nCount++) {
        ad5940_buff_put(&pRegReadData[nCount], nTcv);
      }
    }
  }
  return AD5940ERR_OK;
}
#endif

#ifdef ENABLE_EDA_APP
/*!
  ****************************************************************************
  *@brief      Read EDA data from the AD5940.
  *@param      *pBuff: point to an array in which the data will be placed
  *@param      *pCount:FIFO count
  *@return     int8_t A 8-bit integer: 0 ( success );  -1 ( failure )
******************************************************************************/
AD5940Err AppEDAISR(void *pBuff, uint32_t *pCount)  {
  uint32_t nCount;
  int32_t *pBuffer;

  if(AppEDACfg.EDAInited == bFALSE)
    return AD5940ERR_APPERROR;
  /* if ISR has occured */
  if(gnAd5940DataReady)  {
     /* clear ISR flag */
    gnAd5940DataReady = 0;

    /* Wakeup AFE by read register, read 10 times at most */
    if(AD5940_WakeUp(10) > 10)  {
    /* Wakeup Failed */
     return AD5940ERR_WAKEUP;
    }
#ifndef EXTERNAL_TRIGGER_EDA
    /* We are operating registers, so we don't allow AFE enter sleep mode which is done in our sequencer */
    AD5940_SleepKeyCtrlS(SLPKEY_LOCK);  /* Don't enter hibernate */
#endif
    *pCount = 0;

    /* increment fetch count variable */
    gn_eda_fetch_data_cnt++;

    /* If FIFO threshold flag is set high in AD5940 register field, read FIFO data */
    if(AD5940_INTCTestFlag(AFEINTC_0, AFEINTSRC_DATAFIFOTHRESH) == bTRUE) {
      /* Now there should be 4 fifo data ; number of samples to read is being set in
      eda app which FIFO threshold variable*/
      FifoCount = (AD5940_FIFOGetCnt()/4)*4;

      if(FifoCount > AppEDACfg.FifoThresh)  {
        /* check for FIFO Overflow */
        if(AD5940_INTCTestFlag(AFEINTC_0, AFEINTSRC_DATAFIFOOF) == bTRUE) {
          /* set fifo over flow flag */
          FifoOverflow = 1;
          /* read fifo count */
          fifo_cnt = AD5940_FIFOGetCnt();
        }
      }
      /* read fifo */
      AD5940_FIFORd((int32_t *)pBuff, FifoCount);
      /* clear fifo threshold */
      AD5940_INTCClrFlag(AFEINTSRC_DATAFIFOTHRESH);
       /* If there is need to do AFE re-configure, do it here when AFE is in active state */
      AppEDARegModify(pBuff, &FifoCount);
#ifndef EXTERNAL_TRIGGER_EDA
      /* Manually put AFE back to hibernate mode. This operation only takes effect when register value is ACTIVE previously */
      AD5940_EnterSleepS();
      /* Don't enter hibernate */
      AD5940_SleepKeyCtrlS(SLPKEY_UNLOCK);  /* Don't enter hibernate */
#endif
      /* Process data */
      AppEDADataProcess((int32_t*)pBuff,&FifoCount);
      *pCount = FifoCount;

