ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/drivers/ad5940/ad5940_buffering.c
      /* Process data and timw */
      if(FifoCount != 0){
        if (gnAd5940TimePrevVal != 0) {
          /* this happens in roll over when current time value is less than previous,
          handle roll over of time stamp */
          if(gnAd5940TimeCurVal < gnAd5940TimePrevVal)  {
            /* MAX_RTC_TICKS_FOR_24_HOUR:- Max RTC Count value returned by get_sensor_timestamp() after 24hrs.
             Adding that value to have correct TimeGap value during day roll-over */
            gnAd5940TimeGap = (uint16_t)((MAX_RTC_TICKS_FOR_24_HOUR + gnAd5940TimeCurVal - gnAd5940TimePrevVal) / FifoCount);
            day_roll_over = true;
          }
          /* calculate time gap based on current time value - previous value */
          else  {
            gnAd5940TimeGap = (uint16_t)((gnAd5940TimeCurVal - gnAd5940TimePrevVal) / FifoCount);
          }
        }
        /* occurs when first time Interrupt data is read out , calculate time gap
        based on number of tick of RTC */
        else {
          /* 32KHz is ticks resolution of RTC */
          gnAd5940TimeGap = (uint16_t)((1000.0/AppEDACfg.EDAODR) * RTC_TICKS_PER_MILLI_SEC);//32KHz ticks resolution
        }
      }

      /* assign previous time value with current time value for next iteration */
      gnAd5940TimePrevVal = gnAd5940TimeCurVal;
       /* current time where data is processed */
      nTcv =  get_sensor_time_stamp();
       /* Normally, data processed time > interrupt occured time , hence update
      current time value by difference between current time when data is processed and
      time corresponding to interrupt occured */
      if ((nTcv > gnAd5940TimeCurVal) && (gnAd5940TimeGap != 0))  {
//        gnAd5940TimeCurVal += nTcv - gnAd5940TimeCurVal;
      }
      /* If current data processed time < Interrupt occured time, this could be case of
       roll over, update current time based on data processes time */
      else if((nTcv < gnAd5940TimeCurVal) && (gnAd5940TimeGap != 0))  {
        gnAd5940TimeCurVal = nTcv;
        day_roll_over = true;
      }
      /* else, increment error count */
      else  {
        gn_DivErr_Cnt++;
      }
       /* If roll over flag is set */
      if(day_roll_over) {
      /* MAX_RTC_TICKS_FOR_24_HOUR:- Max RTC Count value returned by get_sensor_timestamp() after 24hrs.
        Adding that value to have correct sample_interval during day roll-over */
        nTcv = (uint32_t)(MAX_RTC_TICKS_FOR_24_HOUR + gnAd5940TimeCurVal - ((FifoCount * gnAd5940TimeGap) - gnAd5940TimeGap));
        /* Reset roll over flag */
        day_roll_over = false;
      }
      else  {
        nTcv = (uint32_t)(gnAd5940TimeCurVal - ((FifoCount * gnAd5940TimeGap) - gnAd5940TimeGap));
      }

      gnAd5940TimeIrqSet1 = 0;

       pBuffer = (int32_t *)pBuff;
       /* put read data from fifo to ring buffer */
       for (nCount = 0; nCount < (FifoCount*2); nCount+=2) {
          //NRF_LOG_DEBUG("pRegReadData[%d]=%u",nCount,pRegReadData[nCount]);
          ad5940_buff_put((int32_t*)&pBuffer[nCount], nTcv);
        }
      }
    }
  return AD5940ERR_OK;
}
#endif

#ifdef ENABLE_BIA_APP
/*!
  ****************************************************************************
  *@brief      Read BIA data from the AD5940.
  *@param     None
  *@return     int8_t A 8-bit integer: 0 ( success );  -1 ( failure )
******************************************************************************/
int8_t ad5940_read_bia_data_to_buffer() {
  int32_t *pRegReadData;
  uint32_t nCount = 0;

  pRegReadData = &anRegReadAd5940Data[0];

  /* if ISR has occured */
  if(gnAd5940DataReady)  {
  /* clear ISR flag */
    gnAd5940DataReady = 0;
   /* Wakeup AFE by read register, read 10 times at most */
  if(AD5940_WakeUp(10) > 10) {
   /* Wakeup Failed */
    return AD5940ERR_WAKEUP;
  }
  /* We are operating registers, so we don't allow AFE enter sleep mode which is done in our sequencer */
  AD5940_SleepKeyCtrlS(SLPKEY_LOCK);

  if(AD5940_INTCTestFlag(AFEINTC_0, AFEINTSRC_DATAFIFOTHRESH) == bTRUE) {
    /* Now there should be 4 data in FIFO */
    BiaFifoCount = AD5940_FIFOGetCnt();
     /* Now there should be fifo data ; number of samples to read is being set in
      eda app which FIFO threshold variable*/
    AD5940_FIFORd(pRegReadData, BiaFifoCount);
    /* clear fifo interrupt */
    AD5940_INTCClrFlag(AFEINTSRC_DATAFIFOTHRESH);
    /* If there is need to do AFE re-configure, do it here when AFE is in active state */
    AppBIARegModify(pRegReadData, &BiaFifoCount);
    /* Manually put AFE back to hibernate mode. */
    AD5940_EnterSleepS();
    /* Allow AFE to enter hibernate mode */
    AD5940_SleepKeyCtrlS(SLPKEY_UNLOCK);
    /* Process data, BiaFifoCount will be modified in AppBIADataProcess as BiaFifoCount/4*/
    AppBIADataProcess((int32_t*)pRegReadData,&BiaFifoCount);
    /* We have two data sets real and imaginary calculated from DFT result*/
    BiaRealImgDataSetCount = BiaFifoCount * 2;
    /* Process data */
    if (gnAd5940TimePrevVal != 0) {
        /* this happens in roll over when current time value is less than previous,
        handle roll over of time stamp */
       if(gnAd5940TimeCurVal < gnAd5940TimePrevVal) {
          /* MAX_RTC_TICKS_FOR_24_HOUR:- Max RTC Count value returned by get_sensor_timestamp() after 24hrs.
          Adding that value to have correct TimeGap value during day roll-over */
          gnAd5940TimeGap = (uint16_t)((MAX_RTC_TICKS_FOR_24_HOUR + gnAd5940TimeCurVal - gnAd5940TimePrevVal) / BiaFifoCount);
          day_roll_over = true;
        }
         /* calculate time gap based on current time value - previous value */
        else  {
          gnAd5940TimeGap = (uint16_t)((gnAd5940TimeCurVal - gnAd5940TimePrevVal) / BiaFifoCount);
        }
     }
     /* occurs when first time Interrupt data is read out , calculate time gap
        based on number of tick of RTC */
     else {
       /* 32KHz is ticks resolution of RTC */
       gnAd5940TimeGap = (uint16_t)((1000.0/AppBIACfg.BiaODR) * RTC_TICKS_PER_MILLI_SEC);//32KHz ticks resolution
     }
     /* assign previous time value with current time value for next iteration */
    gnAd5940TimePrevVal = gnAd5940TimeCurVal;
    /* current time where data is processed */
    nTcv =  get_sensor_time_stamp();

    if ((nTcv > gnAd5940TimeCurVal) && (gnAd5940TimeGap != 0))  {
//       gnAd5940TimeCurVal += nTcv - gnAd5940TimeCurVal;
    }
     /* Normally, data processed time > interrupt occured time , hence update
      current time value by difference between current time when data is processed and
      time corresponding to interrupt occured */
    else if((nTcv < gnAd5940TimeCurVal) && (gnAd5940TimeGap != 0))  {
       gnAd5940TimeCurVal = nTcv;
       day_roll_over = true;
    }
    /* else, increment error count */
    else
       gn_DivErr_Cnt++;
    /* If roll over flag is set */
    if(day_roll_over) {
      /* MAX_RTC_TICKS_FOR_24_HOUR:- Max RTC Count value returned by get_sensor_timestamp() after 24hrs.
        Adding that value to have correct TS during day roll-over */
      nTcv = (uint32_t)(MAX_RTC_TICKS_FOR_24_HOUR + gnAd5940TimeCurVal - ((BiaFifoCount * gnAd5940TimeGap) - gnAd5940TimeGap));
      /* Reset roll over flag */
      day_roll_over = false;
    }
    else  {
      nTcv = (uint32_t)(gnAd5940TimeCurVal - ((BiaFifoCount * gnAd5940TimeGap) - gnAd5940TimeGap));
    }
    gnAd5940TimeIrqSet1 = 0;
    for (nCount = 0; nCount < BiaRealImgDataSetCount; nCount+=2) {
        ad5940_buff_put((int32_t*)&pRegReadData[nCount], nTcv);
    }
  }
 }
  return AD5940ERR_OK;
}
#endif

/*!
  ****************************************************************************
  *@brief     Ad5940 initialization
  *@param     None
  *@return    None
******************************************************************************/
void Ad5940Init() {
  Ad5940RxBufferInit();

   /* configure reset pin of ad5940 */
  nrf_gpio_cfg_output(AD5940_RESET_PIN);
  nrf_gpio_pin_set(AD5940_RESET_PIN);
}
